VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_bufc.h
/* =======================================================  BUF0_CTRL  ======================================================= */
#define BUFC_BUF0_CTRL_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_CTRL_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF0_ADDR  ======================================================= */
#define BUFC_BUF0_ADDR_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_ADDR_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  BUF0_WRITEOFFSET  ==================================================== */
#define BUFC_BUF0_WRITEOFFSET_F00_Pos     (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_WRITEOFFSET_F00_Msk     (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF0_READOFFSET  ==================================================== */
#define BUFC_BUF0_READOFFSET_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_READOFFSET_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF0_WRITESTART  ==================================================== */
#define BUFC_BUF0_WRITESTART_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_WRITESTART_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =====================================================  BUF0_READDATA  ===================================================== */
#define BUFC_BUF0_READDATA_F00_Pos        (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_READDATA_F00_Msk        (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF0_WRITEDATA  ===================================================== */
#define BUFC_BUF0_WRITEDATA_F00_Pos       (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_WRITEDATA_F00_Msk       (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF0_XWRITE  ====================================================== */
#define BUFC_BUF0_XWRITE_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_XWRITE_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF0_STATUS  ====================================================== */
#define BUFC_BUF0_STATUS_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_STATUS_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==================================================  BUF0_THRESHOLDCTRL  =================================================== */
#define BUFC_BUF0_THRESHOLDCTRL_F00_Pos   (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_THRESHOLDCTRL_F00_Msk   (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF0_CMD  ======================================================== */
#define BUFC_BUF0_CMD_F00_Pos             (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF0_CMD_F00_Msk             (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF1_CTRL  ======================================================= */
#define BUFC_BUF1_CTRL_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_CTRL_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF1_ADDR  ======================================================= */
#define BUFC_BUF1_ADDR_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_ADDR_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  BUF1_WRITEOFFSET  ==================================================== */
#define BUFC_BUF1_WRITEOFFSET_F00_Pos     (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_WRITEOFFSET_F00_Msk     (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF1_READOFFSET  ==================================================== */
#define BUFC_BUF1_READOFFSET_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_READOFFSET_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF1_WRITESTART  ==================================================== */
#define BUFC_BUF1_WRITESTART_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_WRITESTART_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =====================================================  BUF1_READDATA  ===================================================== */
#define BUFC_BUF1_READDATA_F00_Pos        (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_READDATA_F00_Msk        (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF1_WRITEDATA  ===================================================== */
#define BUFC_BUF1_WRITEDATA_F00_Pos       (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_WRITEDATA_F00_Msk       (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF1_XWRITE  ====================================================== */
#define BUFC_BUF1_XWRITE_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_XWRITE_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF1_STATUS  ====================================================== */
#define BUFC_BUF1_STATUS_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_STATUS_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==================================================  BUF1_THRESHOLDCTRL  =================================================== */
#define BUFC_BUF1_THRESHOLDCTRL_F00_Pos   (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_THRESHOLDCTRL_F00_Msk   (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF1_CMD  ======================================================== */
#define BUFC_BUF1_CMD_F00_Pos             (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF1_CMD_F00_Msk             (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF2_CTRL  ======================================================= */
#define BUFC_BUF2_CTRL_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_CTRL_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF2_ADDR  ======================================================= */
#define BUFC_BUF2_ADDR_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_ADDR_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  BUF2_WRITEOFFSET  ==================================================== */
#define BUFC_BUF2_WRITEOFFSET_F00_Pos     (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_WRITEOFFSET_F00_Msk     (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF2_READOFFSET  ==================================================== */
#define BUFC_BUF2_READOFFSET_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_READOFFSET_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF2_WRITESTART  ==================================================== */
#define BUFC_BUF2_WRITESTART_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_WRITESTART_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =====================================================  BUF2_READDATA  ===================================================== */
#define BUFC_BUF2_READDATA_F00_Pos        (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_READDATA_F00_Msk        (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF2_WRITEDATA  ===================================================== */
#define BUFC_BUF2_WRITEDATA_F00_Pos       (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_WRITEDATA_F00_Msk       (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF2_XWRITE  ====================================================== */
#define BUFC_BUF2_XWRITE_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_XWRITE_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF2_STATUS  ====================================================== */
#define BUFC_BUF2_STATUS_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_STATUS_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  BUF2_THRESHOLDCTR  =================================================== */
#define BUFC_BUF2_THRESHOLDCTR_F00_Pos    (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_THRESHOLDCTR_F00_Msk    (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF2_CMD  ======================================================== */
#define BUFC_BUF2_CMD_F00_Pos             (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF2_CMD_F00_Msk             (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF3_CTRL  ======================================================= */
#define BUFC_BUF3_CTRL_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_CTRL_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF3_ADDR  ======================================================= */
#define BUFC_BUF3_ADDR_F00_Pos            (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_ADDR_F00_Msk            (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ===================================================  BUF3_WRITEOFFSET  ==================================================== */
#define BUFC_BUF3_WRITEOFFSET_F00_Pos     (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_WRITEOFFSET_F00_Msk     (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF3_READOFFSET  ==================================================== */
#define BUFC_BUF3_READOFFSET_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_READOFFSET_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF3_WRITESTART  ==================================================== */
#define BUFC_BUF3_WRITESTART_F00_Pos      (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_WRITESTART_F00_Msk      (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =====================================================  BUF3_READDATA  ===================================================== */
#define BUFC_BUF3_READDATA_F00_Pos        (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_READDATA_F00_Msk        (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ====================================================  BUF3_WRITEDATA  ===================================================== */
#define BUFC_BUF3_WRITEDATA_F00_Pos       (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_WRITEDATA_F00_Msk       (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF3_XWRITE  ====================================================== */
#define BUFC_BUF3_XWRITE_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_XWRITE_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  BUF3_STATUS  ====================================================== */
#define BUFC_BUF3_STATUS_F00_Pos          (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_STATUS_F00_Msk          (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==================================================  BUF3_THRESHOLDCTRL  =================================================== */
#define BUFC_BUF3_THRESHOLDCTRL_F00_Pos   (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_THRESHOLDCTRL_F00_Msk   (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  BUF3_CMD  ======================================================== */
#define BUFC_BUF3_CMD_F00_Pos             (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_BUF3_CMD_F00_Msk             (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  IF  =========================================================== */
#define BUFC_IF_F00_Pos                   (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_IF_F00_Msk                   (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  IFS  ========================================================== */
#define BUFC_IFS_F00_Pos                  (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_IFS_F00_Msk                  (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  IFC  ========================================================== */
#define BUFC_IFC_F00_Pos                  (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_IFC_F00_Msk                  (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  IEN  ========================================================== */
#define BUFC_IEN_F00_Pos                  (0UL)                     /*!< F00 (Bit 0)                                           */
#define BUFC_IEN_F00_Msk                  (0xffffffffUL)            /*!< F00 (Bitfield-Mask: 0xffffffff)                       */



/** @} */
/** @} End of group EFR32FG1V_BUFC */
/** @} End of group Parts */
